app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    respond_with Post.all

INSERT INTO "posts" ("link", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["link", "yay"], ["title", "yay"], ["user_id", 1], ["created_at", "2016-03-22 13:47:57.107338"], ["updated_at", "2016-03-22 13:47:57.107338"]]
---
  def create
    respond_with Post.create(post_params.merge(user_id: current_user.id))

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    respond_with Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "upvotes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["upvotes", 1], ["updated_at", "2016-03-21 17:59:49.628361"], ["id", 2]]
---
  def upvote
    post = Post.find(params[:id])
    post.increment!(:upvotes)